In [7]:
import pandas as pd
df = pd.DataFrame(
    {
        "a": [4, 5, 6],
        "b": [7, 8, 9],
        "c": [10, 11, 12]
    }
)

df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [8]:
groceries = pd.Series(
    data = [30, 6, 'Yes', 'No'],
    index = ['eggs', 'apples', 'milk', 'bread']
)

groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [9]:
groceries['eggs']

30

In [11]:
groceries.loc[['apples', 'bread']]

apples     6
bread     No
dtype: object

In [12]:
# we can use ilco to access elements in list
groceries.iloc[[2, 3]]

milk     Yes
bread     No
dtype: object

In [13]:
groceries['eggs'] = 50

In [14]:
groceries

eggs       50
apples      6
milk      Yes
bread      No
dtype: object

In [15]:
groceries.drop('appleas')
groceries

KeyError: "['appleas'] not found in axis"

In [16]:
groceries.drop('apples')
groceries

eggs       50
apples      6
milk      Yes
bread      No
dtype: object

In [19]:
groceries.drop('bread', inplace = True)
groceries

eggs     50
milk    Yes
dtype: object

In [21]:
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [22]:
fruits + 2
fruits - 2
fruits ** 2
fruits / 2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [23]:
np.exp(fruits)

NameError: name 'np' is not defined

In [24]:
import numpy as np
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [25]:
np.pow(fruits)

AttributeError: module 'numpy' has no attribute 'pow'

In [26]:
np.power(fruits)

TypeError: power() takes from 2 to 3 positional arguments but 1 were given

In [27]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [28]:
fruits['bananas'] + 2

5

In [29]:
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [30]:
import pandas as pd

items = {
    'Bob': pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
    'Alice': pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])
}
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [33]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [35]:
# We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [40]:
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [45]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [51]:
items2 = [
    {
        'bikes': 20,
        'pants': 30,
        'watches': 35
    },
    {
        'watches': 10, 
        'glasses': 50, 
        'bikes': 15, 
        'pants':5  
    }
]

store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [52]:
store_items['bikes']

store 1    20
store 2    15
Name: bikes, dtype: int64

In [53]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [54]:
#add column to an existing DataFrame
store_items['shirts'] = [40, 50]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      40
store 2     15      5       10     50.0      50

In [55]:
#Add a new column based on the arithmetic operation between existing columns of a DataFrame
store_items['total_clothes'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  total_clothes
store 1     20     30       35      NaN      40             70
store 2     15      5       10     50.0      50             55

In [60]:
new_items = [
    {
        'bikes': 20, 
        'pants': 30, 
        'watches': 35, 
        'glasses': 4,
        'shirts': 30,
        'total_clothes': 70
    }
]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  pants  watches  glasses  shirts  total_clothes
store 3     20     30       35        4      30             70

In [63]:
store_items = store_items.append(new_store)
store_items

AttributeError: 'DataFrame' object has no attribute 'append'

In [64]:
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  total_clothes  new watches
store 1     20     30       35      NaN      40             70          NaN
store 2     15      5       10     50.0      50             55         10.0

In [66]:
#add a new column at a specific location
store_items.insert(4, 'shoes', [8,5])
store_items

,bikes,pants,watches,glasses,shoes,shirts,total_clothes,new watches
store 1,20,30,35,NaN,8,40,70,NaN
store 2,15,5,10,50.0,5,50,55,10.0

In [71]:
# We remove the new watches column
store_items.pop('total_clothes')
store_items

         bikes  pants  watches  glasses  shoes  shirts
store 1     20     30       35      NaN      8      40
store 2     15      5       10     50.0      5      50

In [70]:
store_items

         bikes  pants  watches  glasses  shoes  shirts  total_clothes
store 1     20     30       35      NaN      8      40             70
store 2     15      5       10     50.0      5      50             55

In [72]:
# Delete multiple columns from a DataFrame
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
store_items

         bikes  pants  glasses  shirts
store 1     20     30      NaN      40
store 2     15      5     50.0      50

In [73]:
# Delete rows from a DataFrame
store_items = store_items.drop(['store 1', 'store 2'], axis = 0)
store_items

Empty DataFrame
Columns: [bikes, pants, glasses, shirts]
Index: []

In [74]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})
store_items

Empty DataFrame
Columns: [hats, pants, glasses, shirts]
Index: []

In [ ]:
# Modify the row label
store_items = store_items.rename(index = {'store 3': 'last store'})

In [75]:
# We create a list of Python dictionaries
items2 = [
    {'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
    {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
    {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}
]

store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [79]:
# We count the number of NaN values in store_items
x = store_items.isna().sum().sum()
print(x)

3

In [80]:
# Count NaN down the column.
x = store_items.isna().sum()
print(x)

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [81]:
#Count the total non-NaN values
x = store_items.count()
print(x)

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [82]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [83]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [84]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [86]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

C:\Users\Dell\AppData\Local\Temp\ipykernel_20864\3511060510.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [87]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

C:\Users\Dell\AppData\Local\Temp\ipykernel_20864\2267124478.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [88]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

C:\Users\Dell\AppData\Local\Temp\ipykernel_20864\3028394403.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [89]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

C:\Users\Dell\AppData\Local\Temp\ipykernel_20864\4159178726.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method = 'backfill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0